In [1]:
# Import libraries
from matplotlib import pyplot as plt
import numpy as np
import pandas as pd
import seaborn as sns
sns.set()
from datetime import date 
from sklearn.linear_model import LogisticRegressionCV
from sklearn.linear_model import LinearRegression
from sklearn.model_selection import train_test_split
from sklearn.feature_extraction import DictVectorizer
from sklearn import metrics
from sklearn import ensemble
from sklearn import tree
from sklearn.linear_model import RidgeCV, LassoCV, Ridge, Lasso
from sklearn.preprocessing import StandardScaler
from sklearn.model_selection import cross_val_score

In [4]:
stock_data = pd.read_csv("all_stocks_5yr.csv")
stock_data

              date   open   high    low  close    volume Name
0       2013-02-08  15.07  15.12  14.63  14.75   8407500  AAL
1       2013-02-11  14.89  15.01  14.26  14.46   8882000  AAL
2       2013-02-12  14.45  14.51  14.10  14.27   8126000  AAL
3       2013-02-13  14.30  14.94  14.25  14.66  10259500  AAL
4       2013-02-14  14.94  14.96  13.16  13.99  31879900  AAL
...            ...    ...    ...    ...    ...       ...  ...
619035  2018-02-01  76.84  78.27  76.69  77.82   2982259  ZTS
619036  2018-02-02  77.53  78.12  76.73  76.78   2595187  ZTS
619037  2018-02-05  76.64  76.92  73.18  73.83   2962031  ZTS
619038  2018-02-06  72.74  74.56  72.13  73.27   4924323  ZTS
619039  2018-02-07  72.70  75.00  72.69  73.86   4534912  ZTS

[619040 rows x 7 columns]

In [5]:
def select_columns(data, columns):
    """
    Get a data frame with only specific given columns
    Input(data): dataframe to choose specific columns from
    Input(columns): list of column names to choose
    Output: dataframe with specified columns only
    """
    return data.loc[:, columns]

def rmse(y, yhat):
    """
    Return the rmse given y and yhat
    Input(y): actual value
    Input(yhat): predicted value
    Output: root mean squared error between actual and predicted values
    """
    return np.sqrt(np.mean((y - yhat)**2))

def rmse_score(model, X, y):
    """
    Return the rmse score given the model, X, and y
    Input(model): model used to predict X
    Input (X): predicted values from model
    Input(y): actual value
    Output: root mean squared error score between actual and predicted values from a given model
    """
    return np.sqrt(np.mean((y - model.predict(X)) ** 2))

scaler = StandardScaler()

In [6]:
select_columns(stock_data, ["date", "open"])

              date   open
0       2013-02-08  15.07
1       2013-02-11  14.89
2       2013-02-12  14.45
3       2013-02-13  14.30
4       2013-02-14  14.94
...            ...    ...
619035  2018-02-01  76.84
619036  2018-02-02  77.53
619037  2018-02-05  76.64
619038  2018-02-06  72.74
619039  2018-02-07  72.70

[619040 rows x 2 columns]